Revit 2024 API
AreaLoad.ForceVector3 Property
 The force vector applied to the 3rd reference point of the area load, oriented according to OrientTo setting.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public XYZ ForceVector3 { get; set; }
Visual Basic
Public Property ForceVector3 As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ ForceVector3 {
	XYZ^ get ();
	void set (XYZ^ value);
}
Remarks
 The default force unit is kN/m^2 for metric, and ksf for imperial. Use UnitUtils class methods to convert value from or to internal units.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace